import connectToMongo from "../../db"
import React from 'react'
import Course from "../../models/course"
// var mongoose = require('mongoose');
// var Student = mongoose.model('Student')

async function page() {
    connectToMongo()
    const courses = await Course.create([
    {
        shorttitle: "hsc25scien",
        title: "HSC 2024 মডেল টেস্ট [অফলাইন}",
        courseFee : "9500",
        shortdescription: "-অধ্যায়ভিত্তিক পরীক্ষা: ২৭টি\n-ফাইনাল মডেল টেস্ট: ১৩টি\n-টেস্ট পেপারস সলভ ক্লাস: ১০টি\n-বিষয়ভিত্তিক প্রশ্নব্যাংক: ১৩টি\n-পরীক্ষাভিত্তিক সল্যুশন বুক: ৪০টি\n-ডাউট সলভিংয়ে সার্বক্ষণিক Q & A সেবা",
        details: "প্রিয় HSC-24 বিজ্ঞান বিভাগের পরীক্ষার্থী বন্ধুরা,\n\nতোমরা ইতোমধ্যে জেনেছ যে, তোমাদের এইচএসসি ও সমমানের পরীক্ষা আগামী জুনে অনুষ্ঠিত হতে যাচ্ছে। তাই বলা যায় বোর্ড পরীক্ষার জন্য তোমাদের হাতে খুব বেশি সময় নেই। এজন্যই বোর্ড পরীক্ষার পূর্বে বিষয়ভিত্তিক পূর্ণাঙ্গ প্রস্তুতি অর্জন, পরীক্ষাভীতি দূরীকরণ এবং খুঁটিনাটি ভুলগুলো শুধরে নিয়ে বোর্ড পরীক্ষার জন্য তোমাদেরকে সম্পূর্ণরূপে প্রস্তুত করার লক্ষ্যে উদ্ভাস এর আয়োজন- “HSC 2024 মডেল টেস্ট (বিজ্ঞান বিভাগ)”। তোমাদের পরিপূর্ণ প্রস্তুতি নিশ্চিতকরণের লক্ষ্যে কোর্সটিকে অধ্যায়ভিত্তিক পরীক্ষা, টেস্ট পেপারস সলভ ক্লাস ও ফাইনাল মডেল টেস্ট; এই ৩টি ধাপে বিভক্ত করা হয়েছে। এছাড়া প্রতিটি বিষয়ের উপর পর্যাপ্ত সংখ্যক CQ ও MCQ প্রশ্ন সংবলিত প্রিন্টেড ১৩টি প্রশ্নব্যাংক প্রদান করা হবে।\n\n \n\nStep 1: অধ্যায়ভিত্তিক পরীক্ষা\n\nসম্পূর্ণ সিলেবাসের পরিপূর্ণ প্রস্তুতি গ্রহণের লক্ষ্যে প্রতিটি বিষয়কে সিলেবাস এবং গুরুত্ব অনুযায়ী বিভক্ত করে সর্বমোট ২৭টি অধ্যায়ভিত্তিক পরীক্ষা নেওয়া হবে। প্রতিটি পরীক্ষার সকল প্রশ্নের বিস্তারিত সমাধানসহ সর্বমোট ২৭টি সল্যুশন বুক প্রদান করা হবে। যা তোমাদের ধারাবাহিক প্রস্তুতিকে অধিক কার্যকরী করে তুলবে।\n\n \n\nStep 2: টেস্ট পেপারস সলভ ক্লাস\n\nবোর্ড পরীক্ষায় ভালো করতে বোর্ড অনুরূপ প্রশ্নে বেশি বেশি প্র‌্যাকটিস করা জরুরি। এ লক্ষ্যে এই কোর্সে তোমাদের জন্য থাকছে ১০টি টেস্ট পেপারস সলভ ক্লাস। যার মাধ্যমে তোমরা সেরা কলেজসমূহের বিগত বছরের টেস্ট পরীক্ষার প্রশ্নগুলোর সঠিক সমাধান ও সমাধানের বিভিন্ন কৌশল আয়ত্ত করতে পারবে। ফলে বোর্ড পরীক্ষার জন্য তোমাদের প্রস্তুতি হবে আরও ইফেক্টিভ এবং গোছানো।\n\n \n\nStep 3: ফাইনাল মডেল টেস্ট\n\nশেষ মুহূর্তের চূড়ান্ত প্রস্তুতি নিশ্চিতকরণের লক্ষ্যে এই ধাপে থাকছে ১৩টি ফাইনাল মডেল টেস্ট। প্রতিটি মডেল টেস্টের সকল প্রশ্নের বিস্তারিত সমাধানে থাকছে ১৩টি সল্যুশন বুক। HSC বোর্ড পরীক্ষার অনুরূপ প্রশ্নপত্রে এই পরীক্ষাগুলো দেওয়ার মাধ্যমে তোমরা বোর্ড পরীক্ষার পূর্বেই নিজেকে সম্পূর্ণরূপে প্রস্তুত করতে পারবে।\n\n \n\n► HSC 2024 মডেল টেস্ট কেন প্রয়োজন?\n\n-বোর্ড পরীক্ষার প্রশ্নধারার সাথে পরিচিত হওয়া।\n-সৃজনশীল প্রশ্ন-উত্তর সম্পর্কে পরিষ্কার ধারণা লাভ।\n-পড়ালেখার ধারাবাহিকতা নিশ্চিতকরণ।\n-একই সিলেবাস একাধিকবার রিভিশন।\n-ভুলগুলো চিহ্নিত করে শুধরে নেওয়ার সুযোগ।\n-বিষয়ভিত্তিক পূর্ণাঙ্গ প্রস্তুতি অর্জন।\n-পরীক্ষাভীতি দূরীকরণ।\n-সঠিক প্রশ্ন নির্বাচনে দক্ষতা অর্জন।\n-যথাসময়ে পরীক্ষা শেষ করে উত্তরপত্র রিভিশন।\n-নম্বর বেশি পাওয়ার কৌশল আয়ত্তকরণ।\n-নিজের প্রস্তুতির অবস্থা সম্পর্কে স্বচ্ছ ধারণা অর্জন।\n-বোর্ড পরীক্ষায় অংশগ্রহণের পূর্বে পূর্ণ আত্মবিশ্বাস অর্জন।\n \n\n► শুরু: ১০ মার্চ, ২০২৪ (সম্ভাব্য)\n\n► কোর্স ফি: ৯৫০০/- [অফার ডিসকাউন্ট: ১০০০/-, প্রিভিয়াস শিক্ষার্থীদের জন্য ডিসকাউন্ট: ১০০০/-]\n\n \n\n► একনজরে কোর্স বিবরণী:\n\n-অধ্যায়ভিত্তিক পরীক্ষা: ২৭টি\n-ফাইনাল মডেল টেস্ট: ১৩টি\n-টেস্ট পেপারস সলভ ক্লাস: ১০টি\n-পরীক্ষাভিত্তিক সল্যুশন বুক: ৪০টি\n-প্রিন্টেড বিষয়ভিত্তিক প্রশ্নব্যাংক: ১৩টি\n-ডাউট সলভিংয়ে সার্বক্ষণিক Q & A সেবা",
        Startingdate: "2024-03-10"
    }, 
]);

    return (
        <div>
            jshauyuiqfhui 
        </div>
    )
}

export default page
